1. Посмотреть где я. --- **pwd**<br>
![pwd](/img/pwd.png)<br>

2. Создать папку --- **mkdir folder_name**<br>
![mkdir_f1](/img/mkdir_f1.png)<br>

3. Зайти в папку --- **cd folder_name**<br>
![cd_f1](/img/cd_f1.png)<br>
4. Создать 3 папки --- **mkdir folder_name**<br>
5. Зайти в любоую папку --- **cd folder_name**<br>
6. Создать 5 файлов (3 txt, 2 json) --- **touch object_name**<br>
7. Создать 3 папки --- **mkdir folder_name**<br>
8. Вывести список содержимого папки --- **ls -la**<br>
9. + Открыть любой txt файл --- **vim object_name**<br>
10. + написать туда что-нибудь, любой текст. --- **i**<br>
11. + сохранить и выйти. --- **esc :wq**<br>
12. Выйти из папки на уровень выше --- **cd ..**<br>

---

13. переместить любые 2 файла, которые вы создали, в любую другую папку. --- **mv (что перемещать)object_name object_name (куда перемещать)folder_name**<br>
14. скопировать любые 2 файла, которые вы создали, в любую другую папку. --- **cp (что копировать)object_name object_name (куда копировать)folder_name**<br>
15. Найти файл по имени --- **find . object_name**<br>
16. просмотреть содержимое в реальном времени (команда grep) изучите как она работает. --- **tail -f object_name**<br>
17. вывести несколько первых строк из текстового файла --- **head -5 object_name**<br>
18. вывести несколько последних строк из текстового файла --- **tail -5 t1.txt**<br>
19. просмотреть содержимое длинного файла (команда less) изучите как она работает. --- **cat object_name или less object_name**<br>
20. вывести дату и время --- **date**<br>

---

Задание *
1) Отправить http запрос на сервер. --- **curl http://162.55.220.72:5005/terminal-hw-request**
http://162.55.220.72:5005/terminal-hw-request

1.1 **curl "http://162.55.220.72:5005/get_method?name=Lia&age=25"**

2) Написать скрипт который выполнит автоматически пункты 3, 4, 5, 6, 7, 8, 13
